alexeyk13/rexos/arch/cortex_m3/stm/vectors_stm32.h
/*
    RExOS - embedded RTOS
    Copyright (c) 2011-2014, Alexey Kramarenko
    All rights reserved.
*/

#ifndef VECTORS_STM32_H
#define VECTORS_STM32_H

#if defined(STM32F10X_LD_VL)
/* External Interrupts */
.macro    external_vectors
    .word  WWDG_IRQHandler
    .word  PVD_IRQHandler
    .word  TAMPER_IRQHandler
    .word  RTC_IRQHandler
    .word  FLASH_IRQHandler
    .word  RCC_IRQHandler
    .word  EXTI0_IRQHandler
    .word  EXTI1_IRQHandler
    .word  EXTI2_IRQHandler
    .word  EXTI3_IRQHandler
    .word  EXTI4_IRQHandler
    .word  DMA1_Channel1_IRQHandler
    .word  DMA1_Channel2_IRQHandler
    .word  DMA1_Channel3_IRQHandler
    .word  DMA1_Channel4_IRQHandler
    .word  DMA1_Channel5_IRQHandler
    .word  DMA1_Channel6_IRQHandler
    .word  DMA1_Channel7_IRQHandler
    .word  ADC1_IRQHandler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  EXTI9_5_IRQHandler
    .word  TIM1_BRK_TIM15_IRQHandler
    .word  TIM1_UP_TIM16_IRQHandler
    .word  TIM1_TRG_COM_TIM17_IRQHandler
    .word  TIM1_CC_IRQHandler
    .word  TIM2_IRQHandler
    .word  TIM3_IRQHandler
    .word  0
    .word  I2C1_EV_IRQHandler
    .word  I2C1_ER_IRQHandler
    .word  0
    .word  0
    .word  SPI1_IRQHandler
    .word  0
    .word  USART1_IRQHandler
    .word  USART2_IRQHandler
    .word  0
    .word  EXTI15_10_IRQHandler
    .word  RTCAlarm_IRQHandler
    .word  CEC_IRQHandler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  TIM6_DAC_IRQHandler
    .word  TIM7_IRQHandler
.endm

.macro external_weak_vectors
    weak_vector WWDG_IRQHandler
    weak_vector PVD_IRQHandler
    weak_vector TAMPER_IRQHandler
    weak_vector RTC_IRQHandler
    weak_vector FLASH_IRQHandler
    weak_vector RCC_IRQHandler
    weak_vector EXTI0_IRQHandler
    weak_vector EXTI1_IRQHandler
    weak_vector EXTI2_IRQHandler
    weak_vector EXTI3_IRQHandler
    weak_vector EXTI4_IRQHandler
    weak_vector DMA1_Channel1_IRQHandler
    weak_vector DMA1_Channel2_IRQHandler
    weak_vector DMA1_Channel3_IRQHandler
    weak_vector DMA1_Channel4_IRQHandler
    weak_vector DMA1_Channel5_IRQHandler
    weak_vector DMA1_Channel6_IRQHandler
    weak_vector DMA1_Channel7_IRQHandler
    weak_vector ADC1_IRQHandler
    weak_vector EXTI9_5_IRQHandler
    weak_vector TIM1_BRK_TIM15_IRQHandler
    weak_vector TIM1_UP_TIM16_IRQHandler
    weak_vector TIM1_TRG_COM_TIM17_IRQHandler
    weak_vector TIM1_CC_IRQHandler
    weak_vector TIM2_IRQHandler
    weak_vector TIM3_IRQHandler
    weak_vector I2C1_EV_IRQHandler
    weak_vector I2C1_ER_IRQHandler
    weak_vector SPI1_IRQHandler
    weak_vector USART1_IRQHandler
    weak_vector USART2_IRQHandler
    weak_vector EXTI15_10_IRQHandler
    weak_vector RTCAlarm_IRQHandler
    weak_vector CEC_IRQHandler
    weak_vector TIM6_DAC_IRQHandler
    weak_vector TIM7_IRQHandler
.endm

#elif defined(STM32F10X_LD)
/* External Interrupts */
.macro    external_vectors
    .word    WWDG_IRQHandler
    .word    PVD_IRQHandler
    .word    TAMPER_IRQHandler
    .word    RTC_IRQHandler
    .word    FLASH_IRQHandler
    .word    RCC_IRQHandler
    .word    EXTI0_IRQHandler
    .word    EXTI1_IRQHandler
    .word    EXTI2_IRQHandler
    .word    EXTI3_IRQHandler
    .word    EXTI4_IRQHandler
    .word    DMA1_Channel1_IRQHandler
    .word    DMA1_Channel2_IRQHandler
    .word    DMA1_Channel3_IRQHandler
    .word    DMA1_Channel4_IRQHandler
    .word    DMA1_Channel5_IRQHandler
    .word    DMA1_Channel6_IRQHandler
    .word    DMA1_Channel7_IRQHandler
    .word    ADC1_2_IRQHandler
    .word    USB_HP_CAN1_TX_IRQHandler
    .word    USB_LP_CAN1_RX0_IRQHandler
    .word    CAN1_RX1_IRQHandler
    .word    CAN1_SCE_IRQHandler
    .word    EXTI9_5_IRQHandler
    .word    TIM1_BRK_IRQHandler
    .word    TIM1_UP_IRQHandler
    .word    TIM1_TRG_COM_IRQHandler
    .word    TIM1_CC_IRQHandler
    .word    TIM2_IRQHandler
    .word    TIM3_IRQHandler
    .word    0
    .word    I2C1_EV_IRQHandler
    .word    I2C1_ER_IRQHandler
    .word    0
    .word    0
    .word    SPI1_IRQHandler
    .word    0
    .word    USART1_IRQHandler
    .word    USART2_IRQHandler
    .word    0
    .word    EXTI15_10_IRQHandler
    .word    RTCAlarm_IRQHandler
    .word    USBWakeUp_IRQHandler
.endm

.macro external_weak_vectors
    weak_vector    WWDG_IRQHandler
    weak_vector    PVD_IRQHandler
    weak_vector    TAMPER_IRQHandler
    weak_vector    RTC_IRQHandler
    weak_vector    FLASH_IRQHandler
    weak_vector    RCC_IRQHandler
    weak_vector    EXTI0_IRQHandler
    weak_vector    EXTI1_IRQHandler
    weak_vector    EXTI2_IRQHandler
    weak_vector    EXTI3_IRQHandler
    weak_vector    EXTI4_IRQHandler
    weak_vector    DMA1_Channel1_IRQHandler
    weak_vector    DMA1_Channel2_IRQHandler
    weak_vector    DMA1_Channel3_IRQHandler
    weak_vector    DMA1_Channel4_IRQHandler
    weak_vector    DMA1_Channel5_IRQHandler
    weak_vector    DMA1_Channel6_IRQHandler
    weak_vector    DMA1_Channel7_IRQHandler
    weak_vector    ADC1_2_IRQHandler
    weak_vector    USB_HP_CAN1_TX_IRQHandler
    weak_vector    USB_LP_CAN1_RX0_IRQHandler
    weak_vector    CAN1_RX1_IRQHandler
    weak_vector    CAN1_SCE_IRQHandler
    weak_vector    EXTI9_5_IRQHandler
    weak_vector    TIM1_BRK_IRQHandler
    weak_vector    TIM1_UP_IRQHandler
    weak_vector    TIM1_TRG_COM_IRQHandler
    weak_vector    TIM1_CC_IRQHandler
    weak_vector    TIM2_IRQHandler
    weak_vector    TIM3_IRQHandler
    weak_vector    I2C1_EV_IRQHandler
    weak_vector    I2C1_ER_IRQHandler
    weak_vector    SPI1_IRQHandler
    weak_vector    USART1_IRQHandler
    weak_vector    USART2_IRQHandler
    weak_vector    EXTI15_10_IRQHandler
    weak_vector    RTCAlarm_IRQHandler
    weak_vector    USBWakeUp_IRQHandler
.endm

#elif defined(STM32F10X_MD_VL)
/* External Interrupts */
.macro    external_vectors
    .word  WWDG_IRQHandler
    .word  PVD_IRQHandler
    .word  TAMPER_IRQHandler
    .word  RTC_IRQHandler
    .word  FLASH_IRQHandler
    .word  RCC_IRQHandler
    .word  EXTI0_IRQHandler
    .word  EXTI1_IRQHandler
    .word  EXTI2_IRQHandler
    .word  EXTI3_IRQHandler
    .word  EXTI4_IRQHandler
    .word  DMA1_Channel1_IRQHandler
    .word  DMA1_Channel2_IRQHandler
    .word  DMA1_Channel3_IRQHandler
    .word  DMA1_Channel4_IRQHandler
    .word  DMA1_Channel5_IRQHandler
    .word  DMA1_Channel6_IRQHandler
    .word  DMA1_Channel7_IRQHandler
    .word  ADC1_IRQHandler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  EXTI9_5_IRQHandler
    .word  TIM1_BRK_TIM15_IRQHandler
    .word  TIM1_UP_TIM16_IRQHandler
    .word  TIM1_TRG_COM_TIM17_IRQHandler
    .word  TIM1_CC_IRQHandler
    .word  TIM2_IRQHandler
    .word  TIM3_IRQHandler
    .word  TIM4_IRQHandler
    .word  I2C1_EV_IRQHandler
    .word  I2C1_ER_IRQHandler
    .word  I2C2_EV_IRQHandler
    .word  I2C2_ER_IRQHandler
    .word  SPI1_IRQHandler
    .word  SPI2_IRQHandler
    .word  USART1_IRQHandler
    .word  USART2_IRQHandler
    .word  USART3_IRQHandler
    .word  EXTI15_10_IRQHandler
    .word  RTCAlarm_IRQHandler
    .word  CEC_IRQHandler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  0
    .word  TIM6_DAC_IRQHandler
    .word  TIM7_IRQHandler
.endm

