alexeyk13/rexos/arch/cortex_m3/stm/vectors_stm32.h
.macro external_weak_vectors
    weak_vector    WWDG_IRQHandler
    weak_vector    PVD_IRQHandler
    weak_vector    TAMP_STAMP_IRQHandler
    weak_vector    RTC_WKUP_IRQHandler
    weak_vector    FLASH_IRQHandler
    weak_vector    RCC_IRQHandler
    weak_vector    EXTI0_IRQHandler
    weak_vector    EXTI1_IRQHandler
    weak_vector    EXTI2_IRQHandler
    weak_vector    EXTI3_IRQHandler
    weak_vector    EXTI4_IRQHandler
    weak_vector    DMA1_Stream0_IRQHandler
    weak_vector    DMA1_Stream1_IRQHandler
    weak_vector    DMA1_Stream2_IRQHandler
    weak_vector    DMA1_Stream3_IRQHandler
    weak_vector    DMA1_Stream4_IRQHandler
    weak_vector    DMA1_Stream5_IRQHandler
    weak_vector    DMA1_Stream6_IRQHandler
    weak_vector    ADC_IRQHandler
    weak_vector    CAN1_TX_IRQHandler
    weak_vector    CAN1_RX0_IRQHandler
    weak_vector    CAN1_RX1_IRQHandler
    weak_vector    CAN1_SCE_IRQHandler
    weak_vector    EXTI9_5_IRQHandler
    weak_vector    TIM1_BRK_TIM9_IRQHandler
    weak_vector    TIM1_UP_TIM10_IRQHandler
    weak_vector    TIM1_TRG_COM_TIM11_IRQHandler
    weak_vector    TIM1_CC_IRQHandler
    weak_vector    TIM2_IRQHandler
    weak_vector    TIM3_IRQHandler
    weak_vector    TIM4_IRQHandler
    weak_vector    I2C1_EV_IRQHandler
    weak_vector    I2C1_ER_IRQHandler
    weak_vector    I2C2_EV_IRQHandler
    weak_vector    I2C2_ER_IRQHandler
    weak_vector    SPI1_IRQHandler
    weak_vector    SPI2_IRQHandler
    weak_vector    USART1_IRQHandler
    weak_vector    USART2_IRQHandler
    weak_vector    USART3_IRQHandler
    weak_vector    EXTI15_10_IRQHandler
    weak_vector    RTC_Alarm_IRQHandler
    weak_vector    OTG_FS_WKUP_IRQHandler
    weak_vector    TIM8_BRK_TIM12_IRQHandler
    weak_vector    TIM8_UP_TIM13_IRQHandler
    weak_vector    TIM8_TRG_COM_TIM14_IRQHandler
    weak_vector    TIM8_CC_IRQHandler
    weak_vector    DMA1_Stream7_IRQHandler
    weak_vector    FSMC_IRQHandler
    weak_vector    SDIO_IRQHandler
    weak_vector    TIM5_IRQHandler
    weak_vector    SPI3_IRQHandler
    weak_vector    UART4_IRQHandler
    weak_vector    UART5_IRQHandler
    weak_vector    TIM6_DAC_IRQHandler
    weak_vector    TIM7_IRQHandler
    weak_vector    DMA2_Stream0_IRQHandler
    weak_vector    DMA2_Stream1_IRQHandler
    weak_vector    DMA2_Stream2_IRQHandler
    weak_vector    DMA2_Stream3_IRQHandler
    weak_vector    DMA2_Stream4_IRQHandler
    weak_vector    ETH_IRQHandler
    weak_vector    ETH_WKUP_IRQHandler
    weak_vector    CAN2_TX_IRQHandler
    weak_vector    CAN2_RX0_IRQHandler
    weak_vector    CAN2_RX1_IRQHandler
    weak_vector    CAN2_SCE_IRQHandler
    weak_vector    OTG_FS_IRQHandler
    weak_vector    DMA2_Stream5_IRQHandler
    weak_vector    DMA2_Stream6_IRQHandler
    weak_vector    DMA2_Stream7_IRQHandler
    weak_vector    USART6_IRQHandler
    weak_vector    I2C3_EV_IRQHandler
    weak_vector    I2C3_ER_IRQHandler
    weak_vector    OTG_HS_EP1_OUT_IRQHandler
    weak_vector    OTG_HS_EP1_IN_IRQHandler
    weak_vector    OTG_HS_WKUP_IRQHandler
    weak_vector    OTG_HS_IRQHandler
    weak_vector    DCMI_IRQHandler
    weak_vector    CRYP_IRQHandler
    weak_vector    HASH_RNG_IRQHandler
.endm
#else
#error STM architecture unknown
#endif

#endif // VECTORS_STM32_H
